# DataFrame Creation

In [1]:
import pandas as pd

<br>
create a DataFrame from Dictionaries

In [2]:
record1 = pd.Series({"Name" : "Amir",
                    "Class" : "Physics",
                    "Score" : 90})


record2 = pd.Series({"Name" : "Farshad",
                    "Class" : "Chemistry",
                    "Score" : 78})


record3 = pd.Series({"Name" : "Sara",
                    "Class" : "Mathematics",
                    "Score" : 82})


record4 = pd.Series({"Name" : "Shirin",
                    "Class" : "Software Engineering",
                    "Score" : 92})

df = pd.DataFrame([record1, record2, record3, record4], ["School1", "chool2", "School1", "School4"])
df.head()

            Name                 Class  Score
School1     Amir               Physics     90
chool2   Farshad             Chemistry     78
School1     Sara           Mathematics     82
School4   Shirin  Software Engineering     92

 <br>
create a DataFrame from a list of Dictionaries

In [3]:
students = [{"Name" : "Amir",
            "Class" : "Physics",
            "Score" : 90},
           {"Name" : "Farshad",
           "Class" : "chemistry",
           "Score" : 78},
            {"Name" : "Sara",
           "Class" : "Mathematics",
           "Score" : 82},
           {"Name" : "Shirin",
           "Class" : "Software Engineering",
           "Score" : 92}]

df = pd.DataFrame(students, ["School1", "School2", "School1", "School4"])
df.head()

            Name                 Class  Score
School1     Amir               Physics     90
School2  Farshad             chemistry     78
School1     Sara           Mathematics     82
School4   Shirin  Software Engineering     92

# Querying DataFrame

In [4]:
df.loc["School1"]

         Name        Class  Score
School1  Amir      Physics     90
School1  Sara  Mathematics     82

In [5]:
df.iloc[[1,3]]

            Name                 Class  Score
School2  Farshad             chemistry     78
School4   Shirin  Software Engineering     92

In [6]:
df.loc["School4"]

Name                   Shirin
Class    Software Engineering
Score                      92
Name: School4, dtype: object

In [7]:
df.loc["School1", "Name"]

School1    Amir
School1    Sara
Name: Name, dtype: object

In [8]:
df.loc["School1", ["Name", "Score"]]

         Name  Score
School1  Amir     90
School1  Sara     82

In [9]:
df.loc[["School2", "School4"], "Name"]

School2    Farshad
School4     Shirin
Name: Name, dtype: object

In [10]:
type(df.loc[["School2", "School4"], "Name"])

pandas.core.series.Series

In [11]:
df.loc[["School2", "School4"], ["Name", "Score"]]

            Name  Score
School2  Farshad     78
School4   Shirin     92

In [12]:
type(df.loc[["School2", "School4"], ["Name", "Score"]])

pandas.core.frame.DataFrame

In [13]:
df.loc["School4", "Name"]

'Shirin'

In [14]:
type(df.loc["School4", "Name"])

str

In [15]:
df.T

       School1    School2      School1               School4
Name      Amir    Farshad         Sara                Shirin
Class  Physics  chemistry  Mathematics  Software Engineering
Score       90         78           82                    92

In [16]:
df.T.loc["Name"]

School1       Amir
School2    Farshad
School1       Sara
School4     Shirin
Name: Name, dtype: object

In [17]:
df.T.loc[["Name", "Score"], "School1"]

      School1 School1
Name     Amir    Sara
Score      90      82

In [18]:
df

            Name                 Class  Score
School1     Amir               Physics     90
School2  Farshad             chemistry     78
School1     Sara           Mathematics     82
School4   Shirin  Software Engineering     92

In [19]:
df["Name"]

School1       Amir
School2    Farshad
School1       Sara
School4     Shirin
Name: Name, dtype: object

In [20]:
type(df["Name"])

pandas.core.series.Series

In [21]:
df.loc["Score"]

KeyError: 'Score'

In [22]:
df.loc["School1"]["Name"]

School1    Amir
School1    Sara
Name: Name, dtype: object

In [23]:
print(type(df.loc["School1"]))
print(type(df.loc["School1"]["Name"]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [24]:
df.loc[:, ["Name", "Score"]]

            Name  Score
School1     Amir     90
School2  Farshad     78
School1     Sara     82
School4   Shirin     92

In [25]:
DF = df.loc[["School1", "School4"], ["Name", "Score"]]
DF

           Name  Score
School1    Amir     90
School1    Sara     82
School4  Shirin     92

In [26]:
DF.drop("School1")

           Name  Score
School4  Shirin     92

In [27]:
DF

           Name  Score
School1    Amir     90
School1    Sara     82
School4  Shirin     92

In [28]:
DF.drop("School4", inplace=True)
DF

         Name  Score
School1  Amir     90
School1  Sara     82

In [29]:
copy_df = df.copy()

copy_df.drop("Name", inplace= True, axis= 1)
copy_df

                        Class  Score
School1               Physics     90
School2             chemistry     78
School1           Mathematics     82
School4  Software Engineering     92

In [30]:
del copy_df["Class"]
copy_df

         Score
School1     90
School2     78
School1     82
School4     92

# exercise :

<br>
add a new label "School3" to the rows of the df using broadcasting technique.

solution 1:

In [31]:
# running time after 100 loops is approximately 3.41 ms ± 113 µs per loop
students = [{"Name" : "Amir",
            "Class" : "Physics",
            "Score" : 90},
           {"Name" : "Farshad",
           "Class" : "chemistry",
           "Score" : 78},
            {"Name" : "Sara",
           "Class" : "Mathematics",
           "Score" : 82},
           {"Name" : "Shirin",
           "Class" : "Software Engineering",
           "Score" : 92}]

df = pd.DataFrame(students, ["School1", "School2", "School1", "School4"])


transpose_df = df.T
transpose_df["School3"] = None # broadcasting technique

transpose_df.loc["Name", "School3"] = "Reza"
transpose_df.loc["Class", "School3"] = "Internet Engineering"
transpose_df.loc["Score", "School3"] = 100

df = transpose_df.T
df

            Name                 Class Score
School1     Amir               Physics    90
School2  Farshad             chemistry    78
School1     Sara           Mathematics    82
School4   Shirin  Software Engineering    92
School3     Reza  Internet Engineering   100

solution 2

In [32]:
# running time after 100 loops is approximately 3.25 ms ± 172 µs per loop
students = [{"Name" : "Amir",
            "Class" : "Physics",
            "Score" : 90},
           {"Name" : "Farshad",
           "Class" : "chemistry",
           "Score" : 78},
            {"Name" : "Sara",
           "Class" : "Mathematics",
           "Score" : 82},
           {"Name" : "Shirin",
           "Class" : "Software Engineering",
           "Score" : 92}]

df = pd.DataFrame(students, ["School1", "School2", "School1", "School4"])


transpose_df = df.T
transpose_df["School3"] = None # broadcasting technique

for label, value in transpose_df["School3"].iteritems():
    if label == "Name":
        transpose_df.loc[label, "School3"] = "Reza"
        
    if label == "Class":
        transpose_df.loc[label, "School3"] = "Internet Engineering"
    
    if label == "Score":
        transpose_df.loc[label, "School3"] = 100
        
df = transpose_df.T
df

            Name                 Class Score
School1     Amir               Physics    90
School2  Farshad             chemistry    78
School1     Sara           Mathematics    82
School4   Shirin  Software Engineering    92
School3     Reza  Internet Engineering   100